server/app/controllers/users_controller.rb

    def create
        fb_params = (params[:user].class == String ? JSON.parse(params[:user]) : params[:user])
        user = User.where('fb_id = ?', fb_params["id"]).first
        if user.blank?
             new_user = User.create!(name: fb_params["name"], gcm_id: fb_params["GCM_ID"], fb_id: fb_params["id"])
---
SELECT "users".* FROM "users" WHERE (fb_id = NULL) ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users"
INSERT INTO "users" ("created_at", "fb_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 26 Jan 2014 00:49:23 UTC +00:00], ["fb_id", 4], ["name", "adam"], ["updated_at", Sun, 26 Jan 2014 00:49:23 UTC +00:00]]